nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe247/demo_apps/shell/pin_mux.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

 #ifndef _PIN_MUX_H_
 #define _PIN_MUX_H_
 
 /*!
  * @addtogroup pin_mux
  * @{
  */
 
 /***********************************************************************************************************************
  * API
  **********************************************************************************************************************/
 
 #if defined(__cplusplus)
 extern "C" {
 #endif
 
 /*!
  * @brief Calls initialization functions.
  *
  */
 void BOARD_InitBootPins(void);
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitPins(void);
 
 /*! @name PORTC13 (number 70), PTC13/J8[28]
   @{ */
 
 /* Symbols to be used with GPIO driver */
 #define BOARD_INITLEDSPINS_LED_RED_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
 #define BOARD_INITLEDSPINS_LED_RED_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
 #define BOARD_INITLEDSPINS_LED_RED_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INITLEDSPINS_LED_RED_PORT PORTC                /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITLEDSPINS_LED_RED_PIN 13U                   /*!<@brief PORT pin number */
 #define BOARD_INITLEDSPINS_LED_RED_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                              /* @} */
 
 /*! @name PORTC12 (number 71), PTC12/J8[27]
   @{ */
 
 /* Symbols to be used with GPIO driver */
 #define BOARD_INITLEDSPINS_LED_BLUE_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
 #define BOARD_INITLEDSPINS_LED_BLUE_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
 #define BOARD_INITLEDSPINS_LED_BLUE_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INITLEDSPINS_LED_BLUE_PORT PORTC                /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITLEDSPINS_LED_BLUE_PIN 12U                   /*!<@brief PORT pin number */
 #define BOARD_INITLEDSPINS_LED_BLUE_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                               /* @} */
 
 /*! @name PORTB11 (number 107), PTB11/J8[4]
   @{ */
 
 /* Symbols to be used with GPIO driver */
 #define BOARD_INITLEDSPINS_LED_GREEN_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
 #define BOARD_INITLEDSPINS_LED_GREEN_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
 #define BOARD_INITLEDSPINS_LED_GREEN_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INITLEDSPINS_LED_GREEN_PORT PORTB                /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITLEDSPINS_LED_GREEN_PIN 11U                   /*!<@brief PORT pin number */
 #define BOARD_INITLEDSPINS_LED_GREEN_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                                /* @} */
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitLEDsPins(void);
 
 /*! @name PORTD17 (number 25), PTD17/J2[2]
   @{ */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PORT PORTD                /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN 17U                   /*!<@brief PORT pin number */
 #define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                          /* @} */
 
 /*! @name PORTE12 (number 23), PTE12/J1[4]
   @{ */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PORT PORTE                /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN 12U                   /*!<@brief PORT pin number */
 #define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                                          /* @} */
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitDEBUG_UARTPins(void);
 
 #if defined(__cplusplus)
 }
 #endif
 
 /*!
  * @}
  */
 #endif /* _PIN_MUX_H_ */
 
 /***********************************************************************************************************************
  * EOF
  **********************************************************************************************************************/
 